// Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1


//Ввод данных
{
Console.WriteLine(msg);
int num = int.Parse(Console.ReadLine()??"0");
return num;
}

if (n>0)
return n==0;
for (int i = n; i <0; i++)
    Console.Write($" {i}");

return n;

//Печать резльтата
void PrintResult(string msg)
{
    Console.WriteLine(msg);
}


Console.Write("Введите число ");
int num = int.Parse(Console.ReadLine()??"0");
PrintResult(n);