//Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.

//Ввод данных
int ReadData(string msg)
{
    Console.WriteLine(msg);
    int num = int.Parse(Console.ReadLine()??"0");
    return num;
}

if (num>=arr.Length)
    return 0;
    return arr[i] = sum(arr, i+1);
    


//Печать резльтата
void PrintResult(string msg)
{
    Console.WriteLine(msg);
}




Console.Write("Введите число M ");
int numA = int.Parse(Console.ReadLine()??"0");
Console.Write("Введите число N ");
int numA = int.Parse(Console.ReadLine()??"0");

